; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	spectrograph7 - mode
	image1 - mode
	thermograph6 - mode
	infrared3 - mode
	infrared2 - mode
	thermograph0 - mode
	thermograph5 - mode
	spectrograph4 - mode
	GroundStation3 - direction
	Star5 - direction
	Star2 - direction
	Star0 - direction
	Star4 - direction
	Star1 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph5)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph7)
	(supports instrument1 infrared2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 spectrograph4)
	(supports instrument3 infrared2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument5 image1)
	(supports instrument5 thermograph5)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star4)
	(supports instrument6 spectrograph4)
	(supports instrument6 infrared3)
	(supports instrument6 thermograph5)
	(calibration_target instrument6 Star5)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star2)
	(supports instrument8 spectrograph7)
	(calibration_target instrument8 Star0)
	(supports instrument9 infrared3)
	(supports instrument9 thermograph0)
	(supports instrument9 thermograph6)
	(calibration_target instrument9 Star1)
	(calibration_target instrument9 Star4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
)
(:goal (and
	(have_image Phenomenon6 thermograph0)
	(have_image Planet7 infrared2)
	(have_image Planet7 spectrograph4)
	(have_image Star8 thermograph5)
	(have_image Star8 image1)
	(have_image Planet9 infrared3)
	(have_image Star10 thermograph6)
	(have_image Star10 thermograph0)
))

)

; plan
1. (turn_to satellite3 star1 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star1)
   goals met: 0 of 8
2. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 0 of 8
3. (calibrate satellite3 instrument9 star1)
   added: (calibrated instrument9)
   goals met: 0 of 8
4. (turn_to satellite3 planet9 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet9)
   goals met: 0 of 8
5. (take_image satellite3 planet9 instrument9 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 1 of 8
6. (turn_to satellite3 phenomenon6 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 phenomenon6)
   goals met: 1 of 8
7. (take_image satellite3 phenomenon6 instrument9 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 2 of 8
8. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 2 of 8
9. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 8
10. (calibrate satellite2 instrument5 star4)
   added: (calibrated instrument5)
   goals met: 2 of 8
11. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 2 of 8
12. (turn_to satellite1 planet7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet7)
   goals met: 2 of 8
13. (take_image satellite1 planet7 instrument3 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 3 of 8
14. (take_image satellite1 planet7 instrument3 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 4 of 8
15. (turn_to satellite2 star8 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star8)
   goals met: 4 of 8
16. (take_image satellite2 star8 instrument5 image1)
   added: (have_image star8 image1)
   goals met: 5 of 8
17. (take_image satellite2 star8 instrument5 thermograph5)
   added: (have_image star8 thermograph5)
   goals met: 6 of 8
18. (turn_to satellite3 star10 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 star10)
   goals met: 6 of 8
19. (take_image satellite3 star10 instrument9 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 7 of 8
20. (take_image satellite3 star10 instrument9 thermograph6)
   added: (have_image star10 thermograph6)
   goals met: 8 of 8
